src/Catalogs/Дополнения/Дополнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дополнения</name>
  <attributes>
    <name>ТипДополнения</name>
    <type>
      <types>EnumRef.ТипыДополнений</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасширения</name>
    <type>
      <types>EnumRef.ТипыРасширений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаБезРасширенияДляВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыДополнений/ТипыДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДополнений</name>
  <enumValues>
    <name>ДополнительныйОтчетИлиОбработка</name>
  </enumValues>
  <enumValues>
    <name>Расширение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Дополнения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	Если Не ТипДополнения = Перечисления.ТипыДополнений.Расширение Тогда
		НепроверяемыеРеквизиты.Добавить("ТипРасширения");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(ИмяФайлаБезРасширенияДляВыгрузки) Тогда
		ИмяФайлаБезРасширенияДляВыгрузки = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Наименование);
		// При выгрузке в файлы точка в конце имени вызывает ошибку.
		Если СтрЗаканчиваетсяНа(ИмяФайлаБезРасширенияДляВыгрузки, ".") Тогда
			ИмяФайлаБезРасширенияДляВыгрузки = Лев(ИмяФайлаБезРасширенияДляВыгрузки, СтрДлина(ИмяФайлаБезРасширенияДляВыгрузки) - 1);
		КонецЕсли;
		ИмяФайлаБезРасширенияДляВыгрузки = СокрЛП(ИмяФайлаБезРасширенияДляВыгрузки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
